/*
  
* All rights reserved.
*
* File Name          : SignalsGeneration.c
* Description        : 信号源产生
*
* Version            : V1.0
* Author             : liu Yong
* Date               : 7/7/2012
*
* OriginalVersion    : V1.0
* Original Author    : liu Yong
* Date               : 7/7/2012
*/

#include "SignalsGeneration.h"
#include "board_init.h"
#include "sensor_test.h"
#include "dma.h"

//波形表
//const uint16_t Sine12bit[32] = {
//    682, 816, 944, 1062, 1166, 1250, 1313, 1352, 1365, 1352,
//    1313, 1250, 1166, 1062, 944, 816, 682, 549, 421, 303, 
//    200, 115, 52, 13, 0, 13, 52, 115, 200, 303, 421, 549};
const uint16_t Sine12bit[32] = {
    735, 850, 957, 1050, 1126, 1183, 1218, 1230, 1218, 1183,
    1126, 1050, 957, 850, 735, 615, 495, 380, 273, 180, 
    104, 47, 12, 0, 12, 47, 104, 180, 273, 380, 495, 615};//VPP==1V


/***************************************************************
振幅77.6%、频率31.25Hz 正弦信号
***************************************************************/		
const uint16_t Sine12bit_776[32]={
		2336, 2702, 3040, 3337, 3580, 3760, 3872, 3909, 3872, 3760,
    3580, 3337, 3040, 2702, 2336, 1954, 1573, 1206, 868, 572, 
    329, 148, 37, 0, 37, 148, 329, 572, 868, 1206, 1573, 1954};

		
/***************************************************************
振幅77.6%、频率7.8125Hz 正弦信号
***************************************************************/		
const uint16_t Sine12bit_128_776[128]={
		2050,2146,2241,2336,2429,2522,2613,2702,2790,2876,2959,3040,3119,3194,3267,
		3337,3403,3465,3524,3580,3631,3678,3721,3760,3795,3825,3851,3872,3888,3900,
		3907,3909,3907,3900,3888,3872,3851,3825,3795,3760,3721,3678,3631,3580,3524,
		3465,3403,3337,3267,3194,3119,3040,2959,2876,2790,2702,2613,2522,2429,2336,
		2241,2146,2050,1954,1858,1763,1667,1573,1479,1387,1296,1206,1119,1033,949,
		868,790,714,642,572,506,443,384,329,278,230,187,148,114,84,
		58,37,21,9,2,0,2,9,21,37,58,84,114,148,187,
		230,278,329,384,443,506,572,642,714,790,868,949,1033,1119,1206,
		1296,1387,1479,1573,1667,1763,1858,1954};	

/***************************************************************
振幅97%、频率7.8125Hz 正弦信号
***************************************************************/	
//const uint16_t Sine12bit_128_97[128]={
//		2563,2683,2802,2920,3037,3152,3266,3378,3488,3595,3699,3801,3899,3993,4084,
//		4171,4254,4332,4406,4475,4539,4598,4652,4700,4744,4781,4813,4840,4860,4875,
//		4884,4886,4884,4875,4860,4840,4813,4781,4744,4700,4652,4598,4539,4475,4406,
//		4332,4254,4171,4084,3993,3899,3801,3699,3595,3488,3378,3266,3152,3037,2920,
//		2802,2683,2563,2443,2323,2204,2084,1966,1849,1734,1620,1508,1398,1291,1187,
//		1086,987,893,802,715,633,554,480,411,347,288,234,186,142,105,
//		73,47,26,11,2,0,2,11,26,47,73,105,142,186,234,
//		288,347,411,480,554,633,715,802,893,987,1086,1187,1291,1398,1508,
//		1620,1734,1849,1966,2084,2204,2323,2443};
const uint16_t Sine12bit_128_97[128]={
		 2050,    2146,    2241,    2336,    2429,    2522,    2613,    2702,    2790,    2876,    2959,    3040,    3119,    3194,    3267,
		 3337,    3403,    3465,    3524,    3580,    3631,    3678,    3721,    3760,    3795,    3825,    3851,    3872,    3888,    3900,
		 3907,    3909,    3907,    3900,    3888,    3872,    3851,    3825,    3795,    3760,    3721,    3678,    3631,    3580,    3524,
		 3465,    3403,    3337,    3267,    3194,    3119,    3040,    2959,    2876,    2790,    2702,    2613,    2522,    2429,    2336,
		 2241,    2146,    2050,    1954,    1858,    1763,    1667,    1573,    1479,    1387,    1296,    1206,    1119,    1033,    949,
		 868,    	790,     714,    	642,     572,     506,     443,     384,     329,     278,     230,     187,     148,     114,     84,
		 58,    	37,      21,    	9,       2,        0,      2,       9,       21,      37,      58,      84,      114,     148,     187,
		 230,    	278,     329,    	384,     443,     506,     572,     642,     714,     790,     868,     949,     1033,    1119,    1206,
		 1296,    1387,    1479,    1573,    1667,    1763,    1858,    1954};

/***************************************************************
振幅50%、频率2Hz 8+39+465 脉冲信号
***************************************************************/			
const uint16_t 	Pulsewave12bit_8_39_465_50[512]={//50%
		0,0,0,0,0,0,0,0,1259,1259,1259,1259,1259,1259,1259,1259,1259,1259,1259,1259,
		1259,1259,1259,1259,1259,1259,1259,1259,1259,1259,1259,1259,1259,1259,1259,
		1259,1259,1259,1259,1259,1259,1259,1259,1259,1259,1259,1259,
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0};

/***************************************************************
振幅75%、频率2Hz 8+39+465 脉冲信号
***************************************************************/		
const uint16_t  Pulsewave12bit_8_39_465_75[512]={//75%
		0,0,0,0,0,0,0,0,1889,1889,1889,1889,1889,1889,1889,1889,1889,1889,1889,1889,
		1889,1889,1889,1889,1889,1889,1889,1889,1889,1889,1889,1889,1889,1889,1889,
		1889,1889,1889,1889,1889,1889,1889,1889,1889,1889,1889,1889,			
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
		0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0};		

const uint16_t Pulsewave12bit[32] = {0,0,0,0,1500,1500,1500,1500,
                                     1500,1500,1500,1500,1500,1500,1500,1500,
                                     1500,1500,1500,1500,1500,1500,1500,1500,
                                     1500,1500,1500,1500,1500,1500,1500,1500};

const uint16_t Directcurrent12bit[32] = {4095,4095,4095,4095,4095,4095,4095,4095,
                                         4095,4095,4095,4095,4095,4095,4095,4095,
                                         4095,4095,4095,4095,4095,4095,4095,4095,
                                         4095,4095,4095,4095,4095,4095,4095,4095};
uint8_t Signal_source_type;
/*******************************************************************************
    函数名：signals_generation_init
    输  入: 
    输  出:
    功能说明：波形发生初始化函数
*/
void signals_generation_init(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;
	TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
	DAC_InitTypeDef  DAC_InitType;
	
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_DAC, ENABLE);
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);

	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AN;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	DAC_InitType.DAC_Trigger=DAC_Trigger_T2_TRGO;	//不使用触发功能 TEN1=0
	DAC_InitType.DAC_WaveGeneration=DAC_WaveGeneration_None;//不使用波形发生
	DAC_InitType.DAC_LFSRUnmask_TriangleAmplitude=DAC_LFSRUnmask_Bit0;//屏蔽、幅值设置
	DAC_InitType.DAC_OutputBuffer=DAC_OutputBuffer_Disable ;	//DAC1输出缓存关闭 BOFF1=1
	DAC_Init(DAC_Channel_1,&DAC_InitType);	 //初始化DAC通道1
	DAC_Cmd(DAC_Channel_1, ENABLE);  //使能DAC通道1
			
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);	
	TIM_TimeBaseStructInit(&TIM_TimeBaseStructure);
	TIM_TimeBaseStructure.TIM_Period = 100;
	TIM_TimeBaseStructure.TIM_Prescaler = 875;
//  TIM_TimeBaseStructure.TIM_Period = 10000;
//	TIM_TimeBaseStructure.TIM_Prescaler = 8400;
	TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up; 
	TIM_TimeBaseStructure.TIM_RepetitionCounter = 0x00;
	TIM_TimeBaseInit(TIM2, &TIM_TimeBaseStructure);
	TIM_SelectOutputTrigger(TIM2, TIM_TRGOSource_Update); 
	TIM_ClearFlag(TIM2,TIM_FLAG_Update);
	TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);		
	MYDMA_Config(DMA1_Stream5,DMA_Channel_7,(u32)&DAC->DHR12R1,(u32)Sine12bit,DMA_DIR_MemoryToPeripheral,32);
	Signal_source_type=signal_sina_30HZ;
}

/*******************************************************************************
    函数名：signals_ON
    输  入: 
    输  出:
    功能说明：波形发生主函数
*/
void signals_ON(uint16_t type)
{
	Signal_source_type=type;
	switch(Signal_source_type)
	{
		case signal_sina_30HZ:
			MYDMA_Config(DMA1_Stream5,DMA_Channel_7,(u32)&DAC->DHR12R1,(u32)Sine12bit_776,DMA_DIR_MemoryToPeripheral,32);
			break;
		case signal_sina_7_8125HZ_776:
			MYDMA_Config(DMA1_Stream5,DMA_Channel_7,(u32)&DAC->DHR12R1,(u32)Sine12bit_128_776,DMA_DIR_MemoryToPeripheral,128);
			break;
		
		case signal_sina_7_8125HZ_97:
			MYDMA_Config(DMA1_Stream5,DMA_Channel_7,(u32)&DAC->DHR12R1,(u32)Sine12bit_128_97,DMA_DIR_MemoryToPeripheral,128);
			break;
		
		case Pulsewave12bit_2HZ_50:
			MYDMA_Config(DMA1_Stream5,DMA_Channel_7,(u32)&DAC->DHR12R1,(u32)Pulsewave12bit_8_39_465_50,DMA_DIR_MemoryToPeripheral,512);
			break;	
		
		case Pulsewave12bit_2HZ_75:
			MYDMA_Config(DMA1_Stream5,DMA_Channel_7,(u32)&DAC->DHR12R1,(u32)Pulsewave12bit_8_39_465_75,DMA_DIR_MemoryToPeripheral,512);
			break;	
		
		case signal_pulse_30HZ:
			MYDMA_Config(DMA1_Stream5,DMA_Channel_7,(u32)&DAC->DHR12R1,(u32)Pulsewave12bit,DMA_DIR_MemoryToPeripheral,32);
			break;
		case signal_direct_current:
			MYDMA_Config(DMA1_Stream5,DMA_Channel_7,(u32)&DAC->DHR12R1,(u32)Directcurrent12bit,DMA_DIR_MemoryToPeripheral,32);
			break;		
		default:
			MYDMA_Config(DMA1_Stream5,DMA_Channel_7,(u32)&DAC->DHR12R1,(u32)Sine12bit,DMA_DIR_MemoryToPeripheral,32);
			break;
	}
	DAC_DMACmd(DAC_Channel_1,ENABLE);	
	TIM_Cmd(TIM2, ENABLE);
//	MYDMA_Enable(DMA1_Stream5,32);     //????DMA??!	
	switch(Signal_source_type)
	{
		case signal_sina_30HZ:
			MYDMA_Enable(DMA1_Stream5,32); 
			break;
		
		case signal_sina_7_8125HZ_776:
			MYDMA_Enable(DMA1_Stream5,128); 
			break;	
		
		case signal_sina_7_8125HZ_97:
			MYDMA_Enable(DMA1_Stream5,128); 
			break;
			
		case Pulsewave12bit_2HZ_50:
			MYDMA_Enable(DMA1_Stream5,512); 
			break;
			 
		case Pulsewave12bit_2HZ_75:
			MYDMA_Enable(DMA1_Stream5,512); 
			break;
		 
		case signal_pulse_30HZ:
				MYDMA_Enable(DMA1_Stream5,32); 
			break;
			
		case signal_direct_current:
			MYDMA_Enable(DMA1_Stream5,32); 
			break;
		
		default :
			MYDMA_Enable(DMA1_Stream5,32); 
			break;
	}
//	//delay_us(500);
}
/*******************************************************************************
    函数名：signals_OFF
    输  入: 
    输  出:
    功能说明：
*/
void signals_OFF(void)
{
	DAC_DMACmd(DAC_Channel_1,DISABLE);	
	TIM_Cmd(TIM2, DISABLE);
}
/*******************************************************************************
    函数名：signals_generation_test
    输  入: 
    输  出:
    功能说明：波形发生测试函数
*/
void signals_generation_test(void)
{
  signals_ON(signal_sina_30HZ);
}
